spec/fixtures/payments/create.yml

---
http_interactions:
- request:
    method: post
    uri: https://sandbox.bitex.la/api/merchants/payments
    body:
      encoding: UTF-8
      string: '{"data":{"type":"payments","attributes":{"amount":100,"currency":1,"keep":10,"callback_url":"https://myawesomesite.com/webhook","customer_reference":"Purchase
        at My Store","merchant_reference":"Sale id: 2212"}}}'
    headers:
      User-Agent:
      - Faraday v0.15.4
      Authorization:
      - your_magic_api_key
      Version:
      - '2.1'
      Content-Type:
      - application/vnd.api+json
      Accept:
      - application/vnd.api+json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 24 Jan 2019 16:39:48 GMT
      Content-Type:
      - application/vnd.api+json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=dc4a988b62b4ece42437bb2c5beb10c8d1548347987; expires=Fri, 24-Jan-20
        16:39:47 GMT; path=/; domain=.bitex.la; HttpOnly
      - _bitex_la_session=RHRkRldCamxBLzdZRnQ4ajlvQmV0NW1lRWkrRGFOMmpqdU1BTzNLMjdqMksyR2JsN0VpdU56cXdQdmlwQmdiSFFBS1NmeFZZQ2VVbHgya2R2ZVBuQnhseWhFZDFPVFVoVnJENEdPTFhxL0NlRWFNZlBuQWtKUGIxRS81UDFub3NRbUxESW5wY0Q2Zmp2TFgyMHpVRU1yYUVuWWI2Vk1PVHhaY2UzYXpWWkdnPS0tZnphd2RiK3JQVHdWMEZ2RHgrRCtNUT09--b0d5f288f0d08b83ab70d6f3fb985f4c48f070b6;
        path=/; secure; HttpOnly
      X-Frame-Options:
      - SAMEORIGIN
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Etag:
      - W/"e8258c4c1df54e5fa38ad2629a35da5a"
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - 5de08453-2b35-4d8e-8e04-eef111bd7bf1
      X-Runtime:
      - '1.093722'
      Strict-Transport-Security:
      - max-age=15552000; includeSubDomains; preload
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Server:
      - cloudflare
      Cf-Ray:
      - 49e3f027d8c180b2-SCL
    body:
      encoding: ASCII-8BIT
      string: '{"data":{"id":"1534","type":"payments","attributes":{"amount":100.0,"callback_url":"https://myawesomesite.com/webhook","confirmed_quantity":0.0,"currency_code":"btc","customer_reference":"Purchase
        at My Store","expected_quantity":100.0,"keep":10.0,"kept":null,"last_quoted_on":"2019-01-24T16:39:48.700Z","merchant_reference":"Sale
        id: 2212","overpaid":null,"quote_valid_until":"2019-01-24T17:39:48.626Z","settlement_amount":null,"settlement_currency":null,"status":"pending","unconfirmed_quantity":0.0,"valid_until":"2019-01-24T17:39:48.626Z"},"relationships":{"address":{"data":{"id":"7073","type":"bitcoin_addresses"}},"coin_deposits":{"data":[]}}},"included":[{"id":"7073","type":"bitcoin_addresses","attributes":{"auto_sell":false,"public_address":"msxBvPqGCUxdnnNHimAzpBajctvPpcc5Ge"},"relationships":{"user":{"data":{"id":"592","type":"users"}},"payment":{"data":{"id":"1534","type":"payments"}}}}]}'
    http_version:
  recorded_at: Thu, 24 Jan 2019 16:39:48 GMT
recorded_with: VCR 4.0.0
